IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM011.
       AUTHOR. MAINFRAMEWIZARD.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SUB PIC 9(3) VALUE ZEROS.
       
       PROCEDURE DIVISION.
       10000-MAIN-PARA.
             PERFORM 20000-FIRST-PARA
             DISPLAY 'CALLING PARA USING PERFORM BY MAINFRAMEWIZARD.COM'
             DISPLAY 'PARA NAME IS  10000-FIRST-PARA'
             STOP RUN.
       20000-FIRST-PARA.
             DISPLAY 'PARA NAME IS  20000-FIRST-PARA'
             PERFORM  30000-THIRD-PARA.
       25000-SECOND-PARA.
             DISPLAY 'PARA NAME IS  25000-SECOND-PARA'.
       30000-THIRD-PARA.
             DISPLAY 'PARA NAME IS  30000-THIRD-PARA'
             PERFORM  25000-SECOND-PARA.
; ; ; ; 