 IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM025.
       AUTHOR. MAINFRAMEWIZARD.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MARKS-OBTAINED  PIC 9(4)  VALUE ZEROS.
       01 MARKS-TOTAL     PIC 9(4)  VALUE ZEROS.
       
       PROCEDURE DIVISION.
       10000-MAIN-PARA.
             MOVE 900  TO MARKS-OBTAINED.
             MOVE 1000 TO MARKS-TOTAL.
             EVALUATE ((MARKS-OBTAINED/MARKS-TOTAL)*100)
                 WHEN 100
                  DISPLAY 'STUDENT HAS 100% MARKS'
                 WHEN NOT 100
                  DISPLAY 'STUDENT DOES NOT HAVE 100% MARKS'
             END-EVALUATE
             STOP RUN.